{"company":{"0":"EMSI","1":"EMSI","2":"EMSI","3":"EMSI","4":"EMSI","5":"EMSI","6":"EMSI","7":"EMSI","8":"EMSI","9":"EMSI","10":"EMSI","11":"EMSI","12":"EMSI","13":"EMSI","14":"EMSI","15":"EMSI","16":"EMSI","17":"EMSI","18":"EMSI"},"id":{"0":0,"1":1,"2":2,"3":3,"4":4,"5":5,"6":6,"7":7,"8":8,"9":9,"10":10,"11":11,"12":12,"13":13,"14":14,"15":15,"16":16,"17":17,"18":18},"position_title":{"0":"Account Manager, Higher Education","1":"Data Engineer","2":"Data Engineer, Web Scraping","3":"Software Engineer","4":"Full Stack Web Developer","5":"Lead Software Engineer","6":"Financial Analyst","7":"Sr. Talent Acquisition Specialist","8":"Corporate Counsel","9":"Graphic Design Intern","10":"Graphic Designer","11":"Marketing Specialist","12":"Product Marketer - Emsi Skills","13":"Product Manager, Global Job Postings","14":"Product Specialist","15":"Economic Analyst, Higher Education","16":"Account Executive, Universities","17":"Business Development Representative","18":"Commercial Account Executive"},"Position_category":{"0":"Higher Education – Client Services ","1":"Corporate – Data and Analytics ","2":"Corporate – Data and Analytics ","3":"Corporate – Data and Analytics ","4":"Corporate – Engineering ","5":"Corporate – Engineering ","6":"Corporate – Finance ","7":"Corporate – Human Resources ","8":"Corporate – Legal ","9":"Corporate – Marketing ","10":"Corporate – Marketing ","11":"Talent – Marketing ","12":"Corporate – Marketing ","13":"Talent – Product ","14":"Higher Education – Product ","15":"Higher Education – Professional Services ","16":"Higher Education – Sales ","17":"Talent – Sales ","18":"Talent – Sales "},"Part_or_Full_time":{"0":"Full Time","1":"Full Time","2":"Full Time","3":"Full Time","4":"Full Time","5":"Full Time","6":"Full Time","7":"Full Time","8":"Full Time","9":"Full Time Internship","10":"Full Time","11":"Full Time","12":"Full Time","13":"Full Time","14":"Full Time","15":"Full Time","16":"Full Time","17":"Full Time Internship","18":"Full Time"},"Location":{"0":"Moscow, ID ","1":"Moscow, ID ","2":"Moscow, ID ","3":"Moscow, ID ","4":"Moscow, ID ","5":"Moscow, ID ","6":"Moscow, ID ","7":"Moscow, ID ","8":"Moscow, ID ","9":"Moscow, ID ","10":"Moscow, ID ","11":"Moscow, ID ","12":"Moscow, ID ","13":"Moscow, ID ","14":"Moscow, ID ","15":"Moscow, ID ","16":"Moscow, ID ","17":"Moscow, ID ","18":"Moscow, ID "},"description":{"0":"Provide top notch customer service experience and maximize customer success with our products. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.","1":"We are looking for a highly motivated data engineer who will find optimal ways to process and enrich messy user-submitted data which will help us better answer questions about the workforce, educational programs, and job opportunities. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder. ","2":"Emsi is looking for a Data Engineer to work on the Web Scraping team. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder","3":"Emsi is looking for a skilled software engineer to work on the Classifiers & Extractors team.  This team builds and maintains high-performance text extraction and classification libraries used to analyze job postings, resumes, and similar documents.  In addition to the machine learning solutions, this team also produces the internal tooling and data pipelines to support teams of taxonomists and curators working to continuously improve Emsi’s classifications and libraries.The ideal candidate has significant experience working in high-performance systems languages, a working knowledge of linear algebra, and at least basic familiarity with machine learning techniques","4":"Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need an experienced developer to join us in producing premier software tools for understanding labor market data. If you’re ready to join a high-functioning team of full stack devs working closely with product managers, data engineers, and designers to create interfaces and visualizations that make nuanced data intelligible, we’d love to hear from you. Applicants to this posting will be considered for positions on the Analyst, CareerCoach, and SkillsMatch development teams. ","5":"Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need a senior front end developer to lead a small team that will build new data-heavy web applications.","6":"The Financial Analyst is part of the Emsi finance team and plays a crucial role in our execution of growth initiatives and constant innovation around optimizing and evaluating existing revenue and expenditure. Success in the role will require a mastery of our culture, history and operating principles to help ensurerobust and thorough analysis and prevent flawed analytical results even if “technically correct.” Forms of data involved in this role are not limited to financial but will also include a wide array of operational and HR data with qualitative information and insights. The operating principle for all analysis will be productionof meaningful and true analysis, never reducing to the production of numbers to support decisions stakeholders have already made. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless theshareholder.","7":"Location: Moscow, IDEmsi is growing rapidly, and we are looking for a Sr. Talent Acquisition Specialist to own the hiring process specifically for our sales roles and leadership roles, to proactively bring in talent and build talent pipelines. We are looking for someone who thrives on building relationships and networking with top talent, and who is innovative in their approach. At Emsi we are committed to our core values of blessing the customer, employee, and shareholders. Our company was founded with the purpose of doing business with high integrity, providing an excellent work environment for people in our community. Hiring excellent candidates is key to continuing that mission. ","8":"Emsi is a fast-growing labor market data and analytics company headquartered in Moscow, Idaho. We are looking to hire a full-time attorney to join our in-house legal team. In this role, you will report to Emsi’s General Counsel, and will work directly with Emsi’s sales and client-services teams – as well as legal, procurement, and leadership within client and vendor organizations – to draft, review, and negotiate commercial contracts. You will also draft and review internal employment and policy documents, and assist Emsi’s General Counsel and Contract Manager in managing Emsi’s client, vendor, and internal legal documents. Because Emsi is a fast-growing company (we are moving into a newly-built corporate headquarters in Moscow ID in December 2020), you will have abundant opportunities to expand your responsibilities as Corporate Counsel. Emsi’s General Counsel serves the day-to-day contract needs of Emsi’s sales and client services operations, but also serves the important role of trusted advisor in many aspects of Emsi’s business, including strategic planning and decision making, internal policymaking, and personnel management. So, as a member of Emsi’s legal team, you will have frequent opportunities to grow both your legal and corporate career experience as you contribute to Emsi’s success in all facets of the business. Emsi legal takes seriously the company’s foundational commitment to bless Emsi’s customers, employees, and shareholders. If you are interested in being an important part of that mission, please apply below. ","9":"In this role you would work with the Marketing team to produce data visualizations, infographics, and page layouts. This role will primarily involve the design and layout of Economic Impact Studies for the higher ed consulting team but can transition into additional design and layout opportunities. A successful candidate will bring a desire to learn, a strict attention to detail, ability to meet deadlines, a basic understanding of translating numbers into graphs and charts, and an eye for page design and typography. ","10":"In this role you would work with the Marketing team to produce corporate design pieces such as blog graphics, product brochures, PowerPoint presentations, data visualizations, etc. Due to the wide variety of project types, this role requires a broad knowledge of design principles and tools, as well as an eagerness to learn and develop new skills.  ","11":"Emsi is searching for a full time (40 hr\/week) Marketing Specialist to join our Talent team. This role is an opportunity to gain hands-on experience working with a CRM, managing email marketing, and executing written content.Typical projects could include: executing and optimizing marketing emails, organizing webinars, writing press releases to announce Emsi’s new business partnerships, tracking campaigns and more.We are looking for someone who is a self starter and can execute with minimal oversight, has strong organizational skills and is a quick and independent learner. This person should also have strong critical thinking and problem solving skills.","12":"Emsi Skills is a free website \/ resource that houses Emsi’s library of 30,000 skills plus an array of prototypes. The site helps people access our library and serves as a powerful entry point for much of the work we do around skills.This position will work with the director of the project to (1) grow and improve the site, (2) promote the site to large audiences, (3) serve the community that uses the site (internal Emsi employees and external Emsi clients), (4) coordinate across many different groups to execute and deliver projects, and (5) create content (case studies, blog posts, etc) to help promote the site. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder. ","13":"Emsi is a leader in global labor analytics, helping a wide variety of clientele from higher education institutions to city\/state governments as well as Fortune 1000 companies. We’ve built our company on the integrity of our data and the drive to be insatiably curious when it comes to solving our client’s talent issues. We’re looking for someone who is passionate about blessing customers to fill this Product role.This role specifically will be focused on leading Emsi’s effort to expand our global footprint in regards to job postings data. This will range from monitoring sources, establishing quality processes, identify key customer requests, work on expanding insights to be extracted from the data and engage with customers on best use cases. You will be working with the Global Product Owner and Data Engineering teams to build solutions.","14":"Provide technical expertise and support to customer needs, internal processes, and product teams.In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.  This position reports to the Product Manager of Career Coach.","15":"The Economic Analyst at Emsi works with the Higher Education (HE) Consulting team to produce innovative datasets, data models, visualizations, and reports that answer our clients’ most pressing problems. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.","16":"Emsi is hiring a results-driven Account Executive who is passionate about customer success in the University market. We are looking for someone who will combine exceptional leadership and quantitative analysis skills, with the ability to work effectively in a highly dynamic environment. As an Account Executive, you will be responsible for generating revenue via the phone and in-person visits with decision makers at Higher Education institutions.  This will involve focusing on driving new market share by prospecting, developing, maintaining and closing business with clients in a defined territory.You should be highly-organized and detail-oriented, with the ability to manage multiple competing priorities. Furthermore, it is important that you display excellent verbal and written communication, interpersonal, and presentation skills.","17":"We are looking for talented Business Development Reps who will help us find and develop new client relationships.  The BDR will work with our sales team and develop leads for our Account Executives through outbound marketing and messaging to targeted accounts.  We value integrity, intelligence, good humor, and a professional who wants to learn, grow, and earn.  Successful performers will be first in line for promotion to a closing role.","18":"Emsi is the leader in Enterprise big data analytics, delivering our software solutions to support mission-critical decisions for our clients.  Visit us at www.economicmodeling.com. We are looking for talented Account Executives who will help us develop long-term client relationships within defined multi-state territories.  In this role you will develop and close new business through your own prospecting as well as through our partner\/channel environment.  Our territories are massive, and the opportunity for growth and quota retirement are real.  We value hunger, intelligence, and a professional who conducts business with impeccable integrity.   "},"core_responsibilities":{"0":"Maintain a strong working knowledge of HE customers at every level of their organization (from decision makers to researchers) and ensure they are equipped with the knowledge, data and tools needed to form and execute their vision.; Identify growth opportunities within the institution and communicate those opportunities with sales and consulting teams.; Negotiate, document and invoice renewals with clients.; Coordinate the implementation of new subscriptions.; Provide ongoing training and consultation to clients.; Make meaningful contact quarterly (minimum) with every client.; Plan strategic location trips to meet with clients at their organization (e.g. travel to Phoenix and meet with all clients in the area).","1":"Be familiar with our data clients, both in-house and external, and determine how best to get our data into their tools.; Build and maintain data processing pipelines for several major data sources for job postings and professional profiles.; Create and preserve knowledge with well-written documentation.; Maintain Elasticsearch clusters and the servers they run on.","2":"Create and improve processes, tools, workflows, and resilient data architecture to scrape web content.  ; Manage data accuracy and quality. ; Identify and rectify any issues with breaks as well as scale scrapers as needed.","3":"Develop and maintain extractors, classifiers, and the data pipelines to support them.; Research the most effective solutions to text extraction and classification problems.; Optimize solutions for maximal document per second per core throughput.; Work with Emsi’s taxonomists and data curators to build the internal tooling and data pipelines necessary to continuously improve our libraries.","4":null,"5":null,"6":"Maintain a working knowledge of Emsi’s various products and services. ; Produce monthly slide decks for Emsi and BUs (typically within 3 working days of month end). ; Schedule BU meetings to occur within 7 working days of month end. ; Attend BU meetings with (a) ability to comment on any apparent data anomalies or reasonable questions and (b) mechanism to record any agreed changes \/ developments and implement immediately so that the same request is not needed twice. ; Coordinate development and production of any special slide decks whether part of the monthly BU meetings or separately (e.g. BU renewals, sales, product trajectories, cost areas, etc.).; Organize data and records, and capably record the results of decisions and discussions so that leadership can rely on your work while assessing success of growth investments.; Produce scopes for any analytics requests, to be agreed to with your manager before performing an analytics request. This process is to be used for all requests even from those higher up the org chart than your manager (e.g. CEO, parent company, investors). ; Quarterly review of product catalogue in SalesForce with product and business leaders to ensure obsolete products are removed and new products are included, with any additions or removals being approved by COO and CEO.; Perform required seasonal reporting to assist in launch of new markets, products or similar, which may include weekly cadence of reporting; looking to transition such projects into the typical workflow when increased cadence no longer provides significant value. ; Play a special role in the annual budget process and periodic forecast updates throughout the year, coordinating such efforts with colleagues on the financial accounting team.; Complete special projects as assigned (e.g. tracking costs related to a grant, or potential insurance and\/or legal claim.); Pursue professional development so that your current abilities and experiences do not define the upper limit on what you can contribute to Emsi. This could include advocating for formal professional development but will also include spending time learning from those you are connected with professionally, such as at Emsi’s parent company. ; Collaborate with IT and others in finance to assist in evaluating and implementing analytical tools and systems with foresight to articulate deficiencies that hold you back from success. ","7":"Write strong job postings, utilizing best practices and where possible Emsi’s own technologies, and keep them fresh; Conduct initial interviews; For postings you specifically own, ensure frequent communication with the candidate, and schedule interviews for that process; Develop and implement strategies to increase our ability to hire difficult positions; Work with our Talent Acquisition specialist to build and manage our internship program; Work with marketing to build out candidate focused marketing campaigns, and implement and maintain a candidate-focused careers page; Build relationships with schools that produce promising candidates; Assist in development of systematic reporting for HR metrics","8":null,"9":"Produce and design both long and short documents using existing templates in Adobe InDesign; Create graphs and charts, primarily using the Chartwell font; Edit photos, create simple data visualizations, and design additional web graphics or page layouts as needed","10":"Assist Corporate Marketing team members with graphics needs; Meet weekly with Design team to collaborate and strategize; Create effective graphics that follow Emsi’s brand guidelines","11":null,"12":"Work with the director of Emsi Skills to help support the many projects and partnerships that we have there; Work with the digital marketing team to create content, improve the site, and execute on projects that will help the site gain wider audiences; Create monthly reports on the site performance; Work with the communications team on blog posts, stories, and other collateral that will help promote the site; Support Emsi’s partnership teams as they have needs for content and materials; Work with the product and engineering teams to create enhancements for the site ","13":null,"14":"Manage new client implementations for all software applications; Act as a knowledgeable resource on products; Build and maintain Career Coach sites; Create reports and resources for all software applications; Gather usage data and generate custom reports using Excel","15":"Conduct quantitative analysis using Emsi data and other data sources to research, model, and report solutions for colleges and universities.; Collaborate with the Director of Higher Education Consulting and team members to scope, build, and deliver standard and custom reports.; Document methodology and findings of the quantitative analyses, with the added ability of simplifying and interpreting the findings to a variety of audiences.; Communicate with clients the findings of the analyses, including how to use the findings to make data-driven decisions.","16":"Building relationships in our University sector; Discovering opportunities to serve potential clients via phone, travel, email and other creative approaches; Making use of creativity and analysis to craft and deliver highly relevant presentations; Learning and implementing the economic concepts, which relate to our services and the situation of our clients; Mentoring less experienced reps; Defining and implementing goals that are critical to the success of the organization","17":"Prospect into a defined account list via phone, email, social selling, and other creative approaches.; Represent our values while conducting business with the highest level of honesty and integrity.; Help potential customers see and define the scope of the issues in their businesses, and position our software solutions to enable these organizations to enact real change.; Use research, creativity, and analysis to craft and deliver relevant messaging at the opportune time.; Work independently without constant oversight; Have personality, be comfortable, enjoy our culture, be competitive","18":"Prospect into enterprise accounts via phone, email, social selling, and other creative approaches.; Build positive professional relationships with clients while working in collaboration with internal team members in marketing, consulting, customer-service and product development, in order to provide impressive solutions leading to impressive results for our clients.; Help potential customers see and define the scope of the issues in their business and deliver software and consulting solutions that empower these organizations to enact real change.; Use research, creativity, and analysis to craft and deliver highly relevant presentations to clients via online meetings or by means of travel to on-site meetings and conferences.; Learn and use the economic and data concepts that relate to our services and the situations of our clients.; Generate sales through outbound prospecting, channel sales, and inbound leads; Effectively mentor and guide your assigned Business Development Rep to help generate leads; Some travel required"},"Organizational Relationships":{"0":null,"1":"This position reports to the Senior Director of Data Innovation.","2":"This position reports to the Senior Director of Data Innovation.","3":null,"4":null,"5":null,"6":"The Financial Analyst reports directly to the Controller and also works closely with COO\/CFO and other stakeholders including BU Leaders, Product, Marketing, Sales and Customer Service Leaders, Sr. Financial Analyst at Parent Company and\/or other designated representatives at Parent Company or other investors and Emsi board members.","7":null,"8":null,"9":"This position reports to our Chief Innovation Officer and works closely with the Higher Education consulting team.","10":"This position reports to our Chief Innovation Officer.","11":null,"12":"Reporting to Emsi’s Chief Innovation Officer ; Working closely with Emsi’s communications team and the director of Emsi Skills; Working closely with Emsi’s digital marketing team; Working closely with Emsi’s engineering and APIs team","13":null,"14":null,"15":null,"16":null,"17":null,"18":null},"Knowledge, Skills, and Abilities":{"0":"Ability to maintain a high level of activity, manage multiple competing priorities, and work effectively in a competitive, results-driven culture.; Ability to positively adapt to change in a highly dynamic work environment.; Experience working on a performance-based compensation structure highly desired.; Outstanding written and verbal communication, presentation, and time management skills.; Highly proficient in using the internet and all MS Office programs, particularly Word, Excel and PowerPoint.; Strong qualitative and quantitative analysis skills.","1":"Strong software engineering, programming, and QA skills; Proficiency with Linux (or other POSIX).; Proficiency with a systems programming language.; Experience with lean\/agile development, kanban, and test-driven development practices, preferred.; Gitlab, AWS ecosystem, preferred.; Experience with D and\/or Scala languages, preferred.; Experience with batch processing (AWS Batch) and\/or Apache Spark (AWS EMR), preferred.","2":"Web scraping experience (Scrapy or similar technologies); Solid understanding of web technologies (HTML, JavaScript, CSS, XPath, JSON, etc); Experience with ETL and creating data pipelines; Basic Linux and Git experience; Python; Scrapy Python library; AWS\/AWS Batch; Familiarity with data processing tools (pandas, regex, SQL)","3":null,"4":null,"5":null,"6":"Strong written and verbal communication skills with the ability to communicate “up” the organizational chart avoiding any surprises. ; Advanced knowledge of Excel and proficiency with Microsoft Office Suite. ; Critical-thinking skills.; Strong organizational skills. ; Ability to handle ambiguous project and maintain feedback through each step to completion.; Ability to coordinate with broad stakeholder groups. ; Ability to judge and balance confident execution of projects with manager input and review, while maintaining awareness to take direct and indirect feedback around the balancing of these competing priorities.; Ability to review your own work for anomalies that indicate flaws in analysis and have the energy and intuition to enquire with relevant parties regarding anything that needs validating or testing.","7":null,"8":null,"9":"Basic familiarity with Adobe InDesign, Acrobat, and other Adobe CC software; Close attention to detail; Ability meet strict deadlines; An artistic eye for the fundamentals of design: color, balance, hierarchy, etc.; Basic grammar and copy editing abilities; Knowledge of Microsoft Office Suite and Google Suite with advanced skills in Excel; Ability to work effectively both independently and in a team environment.; Creative visual problem-solving skills and the ability to translate text and data into compelling graphics","10":"Experience with Adobe Illustrator, Photoshop, inDesign, and other Adobe CC software; An artistic eye for the fundamentals of design: color, balance, hierarchy, etc.; Basic knowledge of UX principles and tools (Figma, Sketch); Ability to meet strict deadlines; Ability to work effectively both independently and in a team environment.; Basic grammar and copy editing abilities; Close attention to detail; Basic knowledge of Microsoft Office Suite and Google Suite","11":null,"12":"Familiarity with Emsi’s data, especially the skills aspect; Strong project management background; Experience with managing websites and techniques used to improve visibility (like SEO); Experience with content creation, especially writing and presenting; Some familiarity with Google Analytics, business reporting, and similar metric; Interest and familiarity with marketing practices and principles","13":null,"14":"Strong oral and written communication skills; Prioritization; Excellent time management; Strong organizational skills","15":"Strong written and verbal communication skills.; Strong analytical skills.; Strong quality assurance skills with attention to detail in both quantitative analyses and technical writing.; Proficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel.; Ability to work effectively both independently and in a team environment.; Creative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings.; Ability to compose written analyses that explain complex economic concepts in simple terms.","16":null,"17":null,"18":null},"Key Skills":{"0":null,"1":null,"2":null,"3":"Systems programming on Linux, including working knowledge of virtual memory, optimizing for cacheline performance, and using the perf toolkit.; Proficient in the D programming language or similar (C, C++).; At least basic knowledge of machine learning techniques.; Working knowledge of linear algebra, experience with Intel MKL or similar desirable.; Good knowledge of algorithms and data structures.; Fluent English, written and spoken.; Git version control.; Debugging with GDB.; AWS S3, EC2, Athena.","4":"Two years of experience with React development in a production environment; Two years or more experience with server-side languages like PHP, Python, or Node; One or more years of experience managing production environments in AWS; Working knowledge of structured databases, e.g. MySQL, PostgreSQL","5":"5 years of experience in front end development; Built production applications with ES6 and React.js; Experience with Node\/Express backends; Hosted applications in AWS; Mentored junior developers","6":null,"7":"Thorough understanding of Emsi’s core values and culture; Strong networking capabilities; Ability to build strong relationships with managers and employees; Understanding of best practices in the hiring process; Strong communication skills; Experience in recruiting or marketing, preferred","8":"Licensed to practice law in a U.S. jurisdiction and ability to obtain Idaho house counsel license (full Idaho license not required) ; Excellent drafting skills (ability to draft clear and concise contract terms at volume); Excellent written communication skills (especially the ability to quickly compose clear and concise emails); Customer-service mindset (Emsi legal exists to help internal “customers” and external customers – legal should never present an unnecessary roadblock to anyone else doing their job); Flexibility (your job will generally be as described above, but you will be expected to contribute how and where you can serve Emsi best – even if that doesn’t fit strictly within your job description)  ; Excellent attitude ","9":null,"10":null,"11":null,"12":null,"13":"Strong written and verbal communication skills; Proficiency in a scripting language (Python preferred); Good handle on SQL; Experience in research","14":null,"15":null,"16":null,"17":"Willing to learn and be coached – we will mentor, develop, and train you; You work hard to win, and hate to lose; Energetic, optimistic, and entrepreneurial ; Desire to work in a mature, sophisticated, professional, and fun sales culture; Excellent communication skills, both verbal and written; Bachelor’s degree desired, but not necessary","18":"1-3 years experience with consultative and solution-based software sales preferred; Demonstrated history of quota achievement in a competitive environment; Energetic, optimistic, and entrepreneurial ; Desire to work in a mature, sophisticated, and professional sales culture; Excellent communication skills, both verbal and written; Ability to positively adapt to change in a highly dynamic work environment; Outstanding written and verbal communication, presentation, and time management skills; Bachelor’s degree highly desired"},"preferred_skills":{"0":null,"1":null,"2":null,"3":null,"4":"Experience with microservice architecture; Experience building and consuming APIs","5":"Built data visualization web products; Collaborated with designers and product owners","6":null,"7":null,"8":"Particular consideration will be given to applicants with expertise in labor and employment law","9":null,"10":null,"11":"Strong writing\/verbal communication skills; Strong organization and collaboration skills; Motivated self starter; Ability to simplify complex concepts and communicate them in written format; Experience in email marketing, preferred","12":null,"13":"Ability to thrive in the world between clarity and chaos; ElasticSearch\/Kibana helpful; Some foreign languages under their belt; A couple of years of experience in a related role","14":null,"15":null,"16":"Bachelor’s Degree, preferred; Minimum of 3 years of work experience; proven sales experience, preferred; Proven experience in conceptual sales, solution selling and value-based selling, preferred; Proven experience with performance based compensation structure, preferred; Proven experience with cold calling, preferred; Proficiency working with MS Office Suite, particularly Word, Excel and PowerPoint; Willingness to travel","17":null,"18":null},"Traits":{"0":null,"1":"Attention to detail; Self-starter; Curious; Customer Oriented; Organized; Problem solving","2":"Attention to detail; Self-starter; Curious; Customer Oriented; Organized; Problem solving","3":null,"4":"Team oriented and ready to work closely with other developers; Comfortable with working in rapid development cycles; Skilled oral and written communicators;  Enthusiastic for learning; Prepared to contribute at a strategic level to engineering excellence discussions from day one","5":"Team oriented and ready to work closely with other developers; Comfortable with working in rapid development cycles, including prototyping; Skilled communicators; Ready to lead by example","6":"Curious ; Focused ; Service-oriented; Analytical; Accountable; Approachable; Honest; Forthright Flexible","7":null,"8":null,"9":"Detail oriented; Creative; Customer oriented; Collaborative","10":"Detail oriented; Creative; Customer oriented; Collaborative","11":null,"12":"Organized and able to handle multiple projects and responsibilities; Focused and diligent; Oriented on execution and delivery; Problem solver ; Good at communicating (writing, presenting)Collaborative ","13":"Intensely curious, adept at problem solving and ok with ambiguity; Incredibly detail oriented with a love for documentation; Able to take charge of a task assigned to them with a good deal of autonomy; Comfortable with working in rapid development cycles; we move fast","14":"Detail oriented; Customer oriented; Team oriented; Self-starter; Technical aptitude","15":null,"16":null,"17":null,"18":null},"Credentials and Experience":{"0":"A Bachelor’s Degree is preferred.; Sales experience and experience working with higher education is strongly preferred.","1":"2+ years Python experience, preferred; 2+ years experience in a professional setting, preferred; Bachelor’s degree, preferred","2":"2+ years Python experience, preferred; Professional experience with web scraping preferred; Bachelor’s degree, preferred","3":null,"4":null,"5":null,"6":"Bachelor’s Degree in accounting, finance, statistics, economics business administration or a related field. ; SaaS experience preferred. ","7":null,"8":null,"9":"Completed high school or equivalent; Some experience with design work. (Portfolio of past projects recommended); Some experience using Adobe CC applications (InDesign required); Basic knowledge of Microsoft Word and Excel","10":"2+ years design experience (Portfolio of past projects recommended); Design training\/courses completed or in-progress","11":null,"12":"Experience with data and website management; Content creation","13":null,"14":"Advanced experience with Excel (advanced functions, graphing, pivot tables, Vlookup formulas); B.A. or B.S. degree preferred; Experience working in an office setting preferred","15":"Bachelor’s degree or master’s degree in Economics or a field with a quantitative and analytic focus, or at least 3-years of experience in performing statistical or economic analysis.; Experience making data-driven decisions, preferably for higher education institutions.","16":null,"17":null,"18":null},"application_requirements":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":"Resume; Cover letter; Three references (with contact info)","9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null},"optional_application_requirements":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":"Professional writing\/drafting sample (e.g., briefs submitted, contracts drafted, etc.)","9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null},"Physical Requirements \/ Work Environment":{"0":null,"1":"Those necessary for general office work; Office environment for majority of the time","2":"Those necessary for general office work; Office environment for majority of the time","3":null,"4":null,"5":null,"6":"Those necessary for general office work. ; Typical office environment majority of the time. ","7":null,"8":null,"9":"Those necessary for general office work; Office environment for majority of the time","10":"Those necessary for general office work; Office environment for majority of the time","11":null,"12":"Those necessary for general office work; Office environment for majority of the time; Work closely with a wide range of people (data scientists, writers\/editors, marketers, executives) ","13":null,"14":"Those necessary for general office work; Office environment for majority of the time","15":null,"16":null,"17":null,"18":null},"job_link":{"0":"https:\/\/jobs.lever.co\/economicmodeling\/c97d9f0f-4809-4d2f-80a5-aea4d7c5a479","1":"https:\/\/jobs.lever.co\/economicmodeling\/b18b606e-bc98-443b-ab72-852cedd71776","2":"https:\/\/jobs.lever.co\/economicmodeling\/2236a017-a4ba-45ae-b75c-2ced903572fb","3":"https:\/\/jobs.lever.co\/economicmodeling\/d4bf3a63-0a62-4b5d-b2d1-15b20ed74180","4":"https:\/\/jobs.lever.co\/economicmodeling\/3e4d2eca-5bc7-4309-b27d-373938c1ce59","5":"https:\/\/jobs.lever.co\/economicmodeling\/3b6c3fe9-ba9c-4193-9990-7b9f3d12f9ab","6":"https:\/\/jobs.lever.co\/economicmodeling\/53b36bf2-ebe0-412b-aec2-bc0c4ab2345d","7":"https:\/\/jobs.lever.co\/economicmodeling\/e290ee6d-59f1-4736-93cb-d638e63e97e6","8":"https:\/\/jobs.lever.co\/economicmodeling\/912d55ec-0246-4095-8c81-bbc993a1fd8b","9":"https:\/\/jobs.lever.co\/economicmodeling\/681f7555-a1eb-4f1b-b7b3-d979c21e9a22","10":"https:\/\/jobs.lever.co\/economicmodeling\/526ae978-4794-49b5-b46a-1196ad606e93","11":"https:\/\/jobs.lever.co\/economicmodeling\/e5382e42-7d63-49dc-9ad1-ac8c215b6453","12":"https:\/\/jobs.lever.co\/economicmodeling\/c954a7bb-6312-4a9f-8168-b571458245ea","13":"https:\/\/jobs.lever.co\/economicmodeling\/349ca93d-fcb7-494f-88a8-8f75712c8e86","14":"https:\/\/jobs.lever.co\/economicmodeling\/d7aa3f0f-261a-44b0-ac8f-346fff74aca6","15":"https:\/\/jobs.lever.co\/economicmodeling\/912f06cf-a3af-41d2-8ee6-32655fe3ccd2","16":"https:\/\/jobs.lever.co\/economicmodeling\/31bc3b10-224f-4f19-a3c6-e1a0a5059ead","17":"https:\/\/jobs.lever.co\/economicmodeling\/1999a4b5-0783-45d9-843a-e50d86263831","18":"https:\/\/jobs.lever.co\/economicmodeling\/7e877539-d5fb-43fb-933c-a960c958501c"},"link_to_apply":{"0":"https:\/\/jobs.lever.co\/economicmodeling\/c97d9f0f-4809-4d2f-80a5-aea4d7c5a479\/apply","1":"https:\/\/jobs.lever.co\/economicmodeling\/b18b606e-bc98-443b-ab72-852cedd71776\/apply","2":"https:\/\/jobs.lever.co\/economicmodeling\/2236a017-a4ba-45ae-b75c-2ced903572fb\/apply","3":"https:\/\/jobs.lever.co\/economicmodeling\/d4bf3a63-0a62-4b5d-b2d1-15b20ed74180\/apply","4":"https:\/\/jobs.lever.co\/economicmodeling\/3e4d2eca-5bc7-4309-b27d-373938c1ce59\/apply","5":"https:\/\/jobs.lever.co\/economicmodeling\/3b6c3fe9-ba9c-4193-9990-7b9f3d12f9ab\/apply","6":"https:\/\/jobs.lever.co\/economicmodeling\/53b36bf2-ebe0-412b-aec2-bc0c4ab2345d\/apply","7":"https:\/\/jobs.lever.co\/economicmodeling\/e290ee6d-59f1-4736-93cb-d638e63e97e6\/apply","8":"https:\/\/jobs.lever.co\/economicmodeling\/912d55ec-0246-4095-8c81-bbc993a1fd8b\/apply","9":"https:\/\/jobs.lever.co\/economicmodeling\/681f7555-a1eb-4f1b-b7b3-d979c21e9a22\/apply","10":"https:\/\/jobs.lever.co\/economicmodeling\/526ae978-4794-49b5-b46a-1196ad606e93\/apply","11":"https:\/\/jobs.lever.co\/economicmodeling\/e5382e42-7d63-49dc-9ad1-ac8c215b6453\/apply","12":"https:\/\/jobs.lever.co\/economicmodeling\/c954a7bb-6312-4a9f-8168-b571458245ea\/apply","13":"https:\/\/jobs.lever.co\/economicmodeling\/349ca93d-fcb7-494f-88a8-8f75712c8e86\/apply","14":"https:\/\/jobs.lever.co\/economicmodeling\/d7aa3f0f-261a-44b0-ac8f-346fff74aca6\/apply","15":"https:\/\/jobs.lever.co\/economicmodeling\/912f06cf-a3af-41d2-8ee6-32655fe3ccd2\/apply","16":"https:\/\/jobs.lever.co\/economicmodeling\/31bc3b10-224f-4f19-a3c6-e1a0a5059ead\/apply","17":"https:\/\/jobs.lever.co\/economicmodeling\/1999a4b5-0783-45d9-843a-e50d86263831\/apply","18":"https:\/\/jobs.lever.co\/economicmodeling\/7e877539-d5fb-43fb-933c-a960c958501c\/apply"}}